Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-5-9.tmx
Source language: bo
Languages: en

source: བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་དེ་བཞིན་གཤེགས་པའི་སྔོན་གྱི་སྦྱོར་བའི་སྤྲིན་རབ་ཏུ་འགྱེད་ཅིང་བཟོད་པའི་སྟོབས་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། ཆོས་ལ་དབང་བསྒྱུར་བ་ལ་སེམས་ཅན་རབ་ཏུ་སྣང་བར་བྱེད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, who were revealing the infinite power of the diligence of bodhisattvas, and who were describing how, through the power of never turning back from striving for omniscience, were never weary in seeking for an ocean of hearing the Dharma. They were causing beings to engage in serving and making offerings to all the tathāgatas; establishing beings in the great diligence that repels the entire mass of suffering; emanating all the clouds of the bodies of the past practice by the tathāgatas of dedication to the perfection of diligence;

source: བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་སྟོབས་མཐའ་ཡས་པ་ཤིན་ཏུ་སྟོན་ཅིང་།
en: teaching the perfection of diligence of the bodhisattvas;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བརྩམས་པ་ལས་ཕྱིར་མྱི་ལྡོག་པའི་སྟོབས་ཀྱིས་ཐོས་པ་རྒྱ་མཚོ་ཡོངས་སུ་བཙལ་བས་མི་སྐྱོ་བར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བ་ལ་སེམས་ཅན་རབ་ཏུ་གཟུད་པ་དང་། སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་བརྩོན་འགྲུས་ཆེན་པོ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་ལུས་ཐམས་ཅད་ལས་རབ་ཏུ་འགྱེད་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལེ་ལོའི་རི་རྣམ་པར་གཏོར་བ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་ལས་ལ་དབང་བསྒྱུར་བ་ལ་འཇིག་རྟེན་རབ་ཏུ་གཟུད་པ་དང་། རྒྱུན་མི་ཆད་པར་བརྩོན་པར་བྱེད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས།
en: disintegrating the mountains of the laziness of beings; establishing beings in the perfection of patience; and leading the world to power over karma, fixed in their resolve. Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were establishing beings on the path of mindfulness of the bodhisattvas. They were eliminating all obscurations, obstacles, and darkness; turning beings away from all conceit and carelessness; establishing them in the qualities of carefulness; casting down the banner of arrogance, haughtiness, and pride;

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྗེས་སུ་དྲན་པའི་ལམ་ལ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགོད་ཅིང་སྒྲིབ་པ་དང་། བར་དུ་གཅོད་པ་དང་། རབ་རིབ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། རློམ་པ་དང་བག་མེད་པ་ཐམས་ཅད་ལས་སེམས་ཅན་རྣམ་པར་བཟློག་པ་དང་། བག་ཡོད་པའི་ཆོས་ལ་རབ་ཏུ་དགོད་པ་དང་། ཁེངས་པ་འགྱིང་བ་དང་། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་རབ་ཏུ་སྙོལ་བ་དང་། སངས་རྒྱས་ཀྱི་བསམ་གཏན་གྱི་ཡན་ལག་རྒྱ་མཚོ་བརྗོད་པ་དང་། འཇིག་རྟེན་རྣམས་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བསྔགས་པ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ལྡན་པའི་སྔོན་གྱི་ཚུལ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། སེམས་ལ་དབང་བསྒྱུར་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་བྱེད་ཅིང་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: describing an ocean of aspects of the meditation of the buddhas; praising the perfection of meditation to the world; emanating from all their pores clouds of the many past practices by the tathāgatas of the perfection of meditation; and establishing beings in power over mind. Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were emanating from all their pores clouds of the many past practices by the tathāgatas of seeking the Dharma.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་ཚོལ་བ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྐད་ཐམས་ཅད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་པ་དང་། ཡང་དག་པར་ལྟ་བའི་གློག་རབ་ཏུ་འགྱེད་པ་དང་། ཆོས་ཀྱི་རང་བཞིན་གྱི་སྒྲ་དབྱངས་རབ་ཏུ་བསྒྲག་པ་དང་། སེམས་ཅན་རྣམས་ཀྱི་བདག་ཏུ་ལྟ་བའི་རིའི་ལྷུན་རབ་ཏུ་གཞིག་པ་དང་། ལྟ་བ་ཐམས་ཅད་ཀྱི་ཟུག་རྔུ་དབྱུང་བ་དང་། ཐེ་ཙོམ་དང་ཡིད་གཉིས་དང་ནེམ་ནུར་གྱི་རབ་རིབ་རྣམ་པར་བསྩལ་བ་དང་། ཡེ་ཤེས་ཀྱི་དབང་ཡང་དག་པར་བསྔགས་པ་བྱེད་ཅིང་།
en: With all languages, which are an ocean of the aspects of speech, they emitted the thunder of the clouds of the perfection of wisdom; radiated the lightning of the correct view; resounded with the words on the nature of phenomena; destroyed the mountains of the view of a self held by beings; extracted the splinters of all wrong views; cleared away doubts, uncertainties, and equivocation; and praised power over motivation.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind and describing the field of the way of skillful methods of all the buddhas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཐབས་མཁས་པའི་ཚུལ་གྱི་དཀྱིལ་འཁོར་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཐབས་མཁས་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། འཇིག་རྟེན་རྣམས་ལ་ཐབས་མཁས་པའི་སྤྱོད་པ་རབ་ཏུ་བརྗོད་པ་དང་། ཐེག་པ་ཆེན་པོའི་འབྱུང་བ་མངོན་པར་བསྟན་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཡང་དག་པར་བསྔགས་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ཐ་མྱི་དད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། འཇིག་རྟེན་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་དབང་གི་དཀྱིལ་འཁོར་རབ་ཏུ་བསྟན་པ་བྱེད་ཅིང་།
en: They were emanating from all their pores clouds of the many past practices by the tathāgatas of skillful methods for all beings, revealing the conduct of skillful methods to the world, explaining skill in the Mahāyāna, praising the fields of all the buddhas, teaching the bodhisattva conduct in which there is no separation between saṃsāra and nirvāṇa, establishing beings in the perfection of skillful methods of the bodhisattvas, and teaching the bodhisattva field of power over rebirth to the world.

source: སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་རྒྱ་མཚོའི་སྤྲིན་གྱི་འབྲུག་སྒྲ་སྒྲོག་ཅིང་།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind through the miraculous power of prayer, and were emanating from all their pores the thunder of the clouds of the ocean of the names of all tathāgatas.

source: བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བསྔགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། སྨོན་ལམ་ཆེན་པོའི་ཤིང་རྟའི་འཁོར་ལོ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་འདྲིལ་བ། ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བ་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ། མི་ཤེས་པའི་རི་རྣམ་པར་འཐོར་བ།
en: They were emanating from all their pores clouds of the many past practices of the pure perfection of prayer of all bodhisattvas; they were praising the perfection of prayer, establishing beings in all the powers of the bodhisattvas;

source: འཇིག་རྟེན་དུ་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་།
en: and they were teaching to the world the rolling of the wheels of the chariot of great prayer until the end of future time, the following of all Dharmas, the repelling of all kleśas, and the destruction of the mountains of ignorance.

source: སྨོན་ལམ་སྣ་ཚོགས་ཀྱི་རྣམ་པར་འཕྲུལ་པས། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་མཐོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་སུམ་ཅུ་པ། ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་སྟེ།
en: Sudhana also continuously saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, filling the realm of phenomena in each instant of mind, and illuminating the strength of the bodhisattvas. They were emitting the sound of the words of the accomplishment of the strength of the bodhisattvas;

source: བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་རབ་ཏུ་སྣང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཡོངས་སུ་བསྒྲུབ་པའི་སྒྲ་རབ་ཏུ་དབྱུང་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྒྲུབ་ཅིང་འབྱིན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུབ་པའི་སྟོབས་ཡོངས་སུ་བསྟན་པ་དང་། ཁོར་ཡུག་དང་རྡོ་རྗེའི་རི་ཐམས་ཅད་ལུས་ཀྱི་སྟེང་དུ་རྡིབ་ཀྱང་མི་ཉམས་པའི་སྟོབས་རབ་ཏུ་བརྗོད་པ་དང་། བསྐལ་པས་ཚིག་པ་ཐམས་ཅད་ཀྱི་མེ་རྒྱ་མཚོའི་ནང་ན་གནས་ཀྱང་ལུས་ལ་གནོད་པ་མེད་པའི་སྟོབས་ཡོངས་སུ་བསྟན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ལག་པའི་མཐིལ་གྱི་ནམ་མཁའི་དབྱིངས་སུ་སྟོན་པའི་སྟོབས་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: emanating from all their pores the clouds of the many past practices by the tathāgatas of the accomplishment and creation of the perfection of strength; teaching the strength that cannot be defeated by all the māras and adversaries; describing the strength that is not weakened even if all Cakravāla vajra mountain ranges were to drop down onto their bodies; teaching the strength with which their bodies will not be harmed even though they remain in an ocean of the fires that incinerate all kalpas; teaching the strength by which one can hold up in the sky, on the palm of the hand, all the vast extent of world realms; and establishing beings in the power over miracles.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་འགེངས་པས་རྒྱུན་མི་གཅོད་པ་མཐོང་ངོ་། །ཡང་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་ནས།
en: Sudhana also saw bodhisattvas issuing forth who were as numerous as the atoms in countless buddha realms, were filling the realm of phenomena in each instant of mind, and were teaching the field of knowledge to beings. They were emanating from all their pores the clouds of the many past practices by the tathāgatas of the pure perfection of knowledge;

source: སེམས་ཅན་རྣམས་ལ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་སྟོན་ཅིང་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པའི་སྔོན་གྱི་སྦྱོར་བ་མང་པོའི་སྤྲིན་རབ་ཏུ་དགྱེ་བ་དང་། འཇིག་རྟེན་རྣམས་ལ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དང་། ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་བརྗོད་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཚན་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་བསྟན་པ་དང་། སྨོན་ལམ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཤིན་ཏུ་ཡངས་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་བདག་མྱེད་པའི་རང་བཞིན་ལ་གཟུད་པ་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་བསྟན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོ་རྣམ་པར་བལྟ་བ་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་རྣམ་པར་དབྱེ་བའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་དབྱེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་མོས་པ་རྣམ་པར་བལྟ་བའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡང་དག་པར་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་གྲོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་འཇུག་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྟན་པ་བྱེད་ཅིང་།
en: revealing to the world the level of knowledge that is the clairvoyant knowledge of the qualities of all the buddhas; teaching the level of knowledge that is the clairvoyant knowledge of the names of all the buddhas; elucidating the level of knowledge that is the clairvoyant knowledge of the accomplishment of all prayers; proclaiming the level of knowledge that is the clairvoyant knowledge of the accomplishment of the prayers for gathering all beings as pupils; proclaiming the level of knowledge that is the clairvoyant knowledge for bringing all beings to understand the nature of selflessness;

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: teaching the level of knowledge that is the clairvoyant knowledge of seeing the ocean of the minds of all beings; explaining the level of knowledge that is the clairvoyant knowledge of the accomplishment of all prayers; categorizing the level of knowledge that is the clairvoyant knowledge that categorizes the faculties of all beings; describing the level of knowledge that is the clairvoyant knowledge that views the thoughts and aspirations of all beings; explicating the level of knowledge that is the clairvoyant knowledge that comprehends the ocean of the karma of all beings; teaching the level of knowledge that is the clairvoyant knowledge that comprehends the ocean of the prayers of all beings; and establishing beings in the perfection of knowledge.

source: །སྤྱི་བོའི་གཙུག་ཏོར་གྱི་གསེབ་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཚན་དམ་པ་དང་། དཔེ་བྱད་བཟང་པོ་རྣམ་པར་དག་པས་བརྒྱན་པ།
en: Sudhana also saw issuing forth, from within Sāgara­dhvaja’s uṣṇīṣa on the crown of his head, the bodies of tathāgatas who were as numerous as the atoms in countless buddha realms and were adorned by the pure signs and features of a great being;

source: འཛམ་བུ་ཆུ་ཀླུང་གི་གསེར་གྱི་རི་བོ་ཤིན་ཏུ་འབར་བ་ལྟར་སྣང་བ་འོད་ཀྱི་དཀྱིལ་འཁོར་ཕྱོགས་བཅུར་སྤ་ཞིང་ཚད་མེད་པར་འབར་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཚུལ་གྱིས་རྒྱས་པར་འགེངས་པའི་དབྱངས་མངའ་བ།
en: who shone like a mountain of Jambu River gold; whose halos shone measurelessly, radiating into the ten directions; whose voices filled the ways of the realm of phenomena, demonstrating the limitless miraculous power of the buddhas. They were sending down the rain from the clouds of Dharma equally on all beings;

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ལ་ཐ་མི་དད་པར་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་འབེབས་པ་སྟེ།
en: sending down onto the bodhisattvas who had gone to the supreme bodhimaṇḍas the rain from the cloud of Dharma called the cloud of the direct knowledge of the separate bases for the complete realm of phenomena ; sending down onto the bodhisattvas who had received empowerment the rain from the cloud of Dharma called the complete cloud of bases

source: འདི་ལྟར་སྙིང་པོ་བྱང་ཆུབ་མཆོག་ཏུ་ཕྱིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གཞིའི་བྱེ་བྲག་མངོན་སུམ་དུ་ཤེས་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བ་ཐོབ་པ་རྣམས་ལ་གཞི་ཀུན་ཏུ་རྟེན་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཆེན་པོའི་རྒྱལ་ཚབ་ཏུ་དབང་བསྐུར་བ་རྣམས་ལ་སྒོ་ཀུན་ནས་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུར་གྱུར་པ་རྣམས་ལ་ཀུན་ནས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོའི་ཚོགས་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་དག་པ་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་གྱི་བྱེ་བྲག་ཤེས་པའི་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་སྦྱོར་བ་དང་ལྡན་པ་རྣམས་ལ་འགྲོ་བ་ཡོངས་སུ་སྡུད་པས་ཀུན་ནས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེར་སྐྱེས་པ་རྣམས་ལ་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པའི་དཀྱིལ་འཁོར་མངོན་སུམ་དུ་དམིགས་པའི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣལ་འབྱོར་ལ་སྤྱོད་པ་རྣམས་ལ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་གཞི་རབ་ཏུ་སྒྲོག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལས་དང་པོ་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་དང་ཐབས་ཀྱི་སྙིང་པོའི་སྤྲིན་ཀུན་ཏུ་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་རྣམས་ལ་དགའ་བར་བགྱི་བའི་མཛོད་ཤིན་ཏུ་བསྩགས་པའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡངས་པ་ལ་མོས་པ་རྣམས་ལ་རྣམ་པར་ཐར་པ་མི་ཟད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྨོན་ལམ་གྱིས་དགའ་བར་བྱེད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གཟུགས་ལ་སྤྱོད་པའི་སེམས་ཅན་རྣམས་ལ་གཞི་ཀུན་ཏུ་མི་ཟད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ཚངས་པའི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཚུལ་རྒྱ་མཚོ་ཚད་མེད་པའི་འབྲུག་སྒྲའི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དབང་བསྒྱུར་གྱི་ལྷ་རྣམས་ལ་སྟོབས་འབྱུང་བའི་ཆོས་ཀྱི་ཡོ་བྱད་མི་ཟད་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་རྒྱལ་མཚན་སྣ་ཚོགས་ཅན་ཡང་དག་པར་བསྒྲུབ་པའི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། འཕྲུལ་དགའི་ལྷ་རྣམས་ལ་ཡེ་ཤེས་རིན་པོ་ཆེ་སྣ་ཚོགས་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དགའ་ལྡན་གྱི་ལྷ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མཚེ་མའི་ལྷ་རྣམས་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་རྗེས་སུ་དྲན་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་མཐོང་བས་དགེ་བའི་ཤུགས་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོའི་གནས་སུ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ནམ་མཁའ་ལ་དེ་བཞིན་གཤེགས་པའི་གནས་རྣམ་པར་འཕྲུལ་པས་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། དྲི་ཟའི་དབང་པོའི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཡང་དག་པར་བགྲོ་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྷ་མ་ཡིན་གྱི་གནས་སུ་ཡེ་ཤེས་ཀྱི་ཚུལ་རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོའི་གནས་སུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་འབྱུང་བའི་ཐབས་ཀྱི་སྤྲིན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མིའམ་ཅིའི་དབང་པོའི་གནས་སུ་ཆོས་ཀྱི་སྤྲིན་ཡང་དག་པར་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབྱངས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ཀླུའི་དབང་པོའི་གནས་སུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་སྒྲོག་ཅིང་སྲིད་པའི་ལམ་གྱི་རྒྱུད་ལས་སྐྱོ་བ་བསྐྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་གནས་སུ་དགའ་བ་རྒྱ་མཚོ་རྣམ་པར་འཕེལ་བར་བྱེད་པའི་ཤུགས་ཤེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། མྱིའི་གནས་སུ་འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཡེ་ཤེས་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། སེམས་ཅན་དམྱལ་བའི་འཇིག་རྟེན་དུ་འཁོར་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བའི་དབྱངས་དང་། འཕགས་པའི་ལམ་གྱི་ཚིག་གི་རྒྱུད་ཀྱིས་བརྒྱན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་ལས་ཀྱི་ལམ་ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་ནན་ཏན་དུ་བྱ་བའི་དབྱངས་དང་། དེ་བཞིན་གཤེགས་པ་རྗེས་སུ་དྲན་པའི་སྤྲིན་གྱི་དཀྱིལ་འཁོར་གྱི་ལྷུན་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒྲག་པ།
en: sending down onto the bodhisattvas who had been empowered as regents of the great Dharma the rain from the cloud of Dharma called complete entry through the gateways; sending down onto the bodhisattvas who were youths the rain from the cloud of Dharma called completely adorned; sending down onto the irreversible bodhisattvas the rain from the cloud of Dharma called the summitof steadfast compassion; sending down onto the bodhisattvas with pure superior motivation the rain from the cloud of Dharma called the vajra of the knowledge of the separate natures of all phenomena; sending down onto the bodhisattvas who had accomplished practice in previous lifetimes the rain from the cloud of Dharma called the display of completely attracting beings; sending down onto the bodhisattvas who had been reborn the rain from the cloud of Dharma called the cloud of the direct perception of the circles of followers of the tathāgatas in the three times; sending down onto the bodhisattvas who were engaged in practice the rain from the cloud of Dharma called declaring the natures and bases of all phenomena; sending down onto beginner bodhisattvas the rain from the cloud of Dharma called the appearance of the cloud of the essence of method and the way great compassion; sending down onto the bodhisattvas who had developed the aspiration for enlightenment for the first time the rain from the cloud of Dharma called the essence of the accumulated treasure that brings joy; sending down onto the bodhisattvas who had vast aspiration the rain from the cloud of Dharma called the treasure that brings joy through unceasing liberations and the prayers of the tathāgatas; sending down onto the beings in the form realm the rain from the cloud of Dharma called the treasure with an unceasing basis; sending down onto the Brahmakāyika devas the rain from the cloud of Dharma called the sound of the roar of an ocean of limitless ways; sending down onto the Para­nirmita­vaśa­vartin devas the rain from the cloud of Dharma called the inexhaustible treasure of the prerequisite qualities for the arising of strength; sending down onto the devas of Māra the rain from the cloud of Dharma called the voice that acquiresthe various banners of the accumulation of omniscience; sending down onto the Nirmāṇarati devas the rain from the cloud of Dharma called dedication to various precious knowledges; sending down onto the Tuṣita devas the rain from the cloud of Dharma called the banner of the various precious prayers of the bodhisattvas; sending down onto the Yāma devas the rain from the cloud of Dharma called the treasure of being mindful of all the tathāgatas; sending down onto the abode of Śakra, the lord of the devas, the rain from the cloud of Dharma called the arising of the power of joythrough seeing the tathāgatas; sending down onto the abode of the lord of the yakṣas the rain from the cloud of Dharma called the emanations of the abodes of the tathāgatas filling the space of the realm of phenomena; sending down onto the abode of the lord of the gandharvas the rain from the cloud of Dharma called the sound of the songsof the Dharma of all the tathāgatas; sending down onto the abode of the lord of the asuras the rain from the cloud of Dharma called the vajra field of the way of wisdom; sending down onto the abode of the lord of the garuḍas the rain from the cloud of Dharma called the cloud of the method for the arising of all the tathāgatas; sending down onto the abode of the lord of the kinnaras the rain from the cloud of Dharma called the singing of the songsof all the clouds of Dharma; sending down onto the abode of the lord of the nāgas the rain from the cloud of Dharma called the miraculous resounding of the bodhisattvas that creates dismay with saṃsāra; sending down onto the abode of the lord of the mahoragas the rain from the cloud of Dharma called the power that increases an ocean of joy;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཏོང་བའི་སེམས་འབྱུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་དང་། སེམས་ཅན་ལོག་པར་ལྟུང་བ་རྣམས་ལ་སྡུག་བསྔལ་ཐམས་ཅད་ཞི་བ་རབ་ཏུ་འཐོབ་པས་དབུགས་འབྱུང་བའི་དབྱངས་ཀྱི་ང་རོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་མངོན་པར་དབབ་པ་མཛད་ཅིང་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་ངོ་།
en: sending down onto the world of humans the rain from the cloud of Dharma called the rangeof knowledge that is superior to that of all beings; sending down onto the world of the hells the rain from the cloud of Dharma called the voice that ends all the suffering of saṃsāra; sending down onto those reborn as animals the rain from the cloud of Dharma called the form of the field of the clouds of mindfulness of the tathāgatas that describes the practice of the path of irreproachable activities; sending down onto those in the world of Yama the rain from the cloud of Dharma called the proclamation of the perfections of all the tathāgatas that gives rise to generosity in the minds of all beings; and sending down onto the beings who had fallen down the rain from the cloud of Dharma called the roar of the voice that brings relief through the attainment of the cessation of all suffering.
